name: "ensemble_1"
platform: "ensemble"

max_batch_size: 16

input [
  {
    name: "INPUT0"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "pre_processor_1"
      model_version: -1
      input_map {
        key: "INPUT0"
        value: "INPUT0"
      }
      output_map {
        key: "FEATURES"
        value: "FEATURES"
      }
      output_map {
        key: "FILENAMES"
        value: "FILENAMES"
      }
    },
    {
      model_name: "predictor_1"
      model_version: -1
      input_map {
        key: "FEATURES"
        value: "FEATURES"
      }
      input_map {
        key: "FILENAMES"
        value: "FILENAMES"
      }
      output_map {
        key: "LABELS"
        value: "LABELS"
      }
    },
    {
      model_name: "post_processor_1"
      model_version: -1
      input_map {
        key: "LABELS"
        value: "LABELS"
      }
      output_map {
        key: "OUTPUT0"
        value: "OUTPUT0"
      }
    }
  ]
}

parameters: [
  {
    key: "EXECUTION_ENV_PATH",
    value: {string_value: "/models/conda-pack.tar.gz"}
  }
]
